# MAT281 - Laboratorio N°03

## Problema 01


<img src="https://imagenes.universia.net/gc/net/images/practicas-empleo/p/pr/pro/profesiones-con-el-avance-de-la-tecnologia.jpg" width="480" height="360" align="center"/>


EL conjunto de datos se denomina `ocupation.csv`, el cual contiene información de distintos usuarios (edad ,sexo, profesión, etc.).

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [1]:
import pandas as pd
import os

In [2]:
# cargar datos
df = pd.read_csv(os.path.join("data","ocupation.csv"), sep="|")
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1.- ¿Cuál es el número de observaciones en el conjunto de datos?

In [3]:
# asumiendo que por observaciones se refiere a la cantidad de filas.
f,c = df.shape
print('la cantidad de observaciones es:')
print(f)

la cantidad de observaciones es:
943

2.- ¿Cuál es el número de columnas en el conjunto de datos?

In [4]:
print ('la cantidad de columnas es:')
print(c)

la cantidad de columnas es:
5

3.- Imprime el nombre de todas las columnas

In [5]:
print(df.columns)

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

4.- Imprima el índice del dataframe

In [6]:
print(df.index)

RangeIndex(start=0, stop=943, step=1)

5.- ¿Cuál es el tipo de datos de cada columna?

In [7]:
print(df.dtypes)

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

6.- Describir el conjunto de datos (**hint**: .describe())

In [8]:
print(df.describe(include='all'))

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

7.- Imprimir solo la columna de **occupation**.

In [9]:
print(df['occupation'])

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

8.- ¿Cuántas ocupaciones diferentes hay en este conjunto de datos?

In [10]:
print(df['occupation'].describe())
desc = df['occupation'].describe()
print('\nHay '+ str(desc[1]) + ' ocupaciones diferentes')

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

Hay 21 ocupaciones diferentes

9.- ¿Cuál es la ocupación más frecuente?

In [11]:
print(str(df['occupation'].describe()[2]) + ' es la ocupación mas frecuente')

student es la ocupación mas frecuente

10.- ¿Cuál es la edad media de los usuarios?

In [12]:
media = df['age'].mean()
print('La edad media es ' + str (int(media)) + ' años')

La edad media es 34 años

11.- ¿Cuál es la edad con menos ocurrencia?

In [13]:
age_min_freq = df['age'].value_counts().min()
mask = (df['age'].value_counts() == age_min_freq)
print('la(s) edad(es) con menor frecuencia son:')
print(df['age'].value_counts()[mask])

la(s) edad(es) con menor frecuencia son:
7     1
66    1
10    1
11    1
73    1
Name: age, dtype: int64

12.- Encontrar la edad promedio según la variable **occupation**

In [14]:
age_p_occ = dict()
occups = df['occupation'].unique()
for occup in occups:
    mask = (df['occupation'] == occup)
    age_p_occ[occup] = int(df['age'][mask].mean())
print(age_p_occ)

{'technician': 33, 'other': 34, 'writer': 36, 'executive': 38, 'administrator': 38, 'student': 22, 'lawyer': 36, 'educator': 42, 'scientist': 35, 'entertainment': 29, 'programmer': 33, 'librarian': 40, 'homemaker': 32, 'artist': 31, 'engineer': 36, 'marketing': 37, 'none': 26, 'healthcare': 41, 'retired': 63, 'salesman': 35, 'doctor': 43}

## Problema 02


<img src="https://image.freepik.com/vector-gratis/varios-automoviles-dibujos-animados_23-2147613095.jpg" width="360" height="360" align="center"/>


EL conjunto de datos se denomina `Automobile_data.csv`, el cual contiene información tal como: compañia, precio, kilometraje, etc.

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [15]:
# cargar datos
df_2 = pd.read_csv(os.path.join("data","Automobile_data.csv")).set_index('index')
df_2.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1. Elimine los valores nulos (Nan)

In [16]:
mask = lambda df: df.notnull().all(axis=1)
df_2 = df_2[mask]
df_2.head(5)

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

2. Encuentra el nombre de la compañía de automóviles más cara

In [17]:
#asumiendo que la mas cara se refiere al precio promedio de los autos que vende dicha compañia

comps = df_2['company'].unique()
max_price = 0
max_comp = str()
for comp in comps:
    df_aux = df_2.loc[lambda x: x['company'] == comp]
    if df_aux['price'].mean() > max_price:
        max_price = df_aux['price'].mean()
        max_comp = comp
print ('La compañia mas cara es ' + max_comp)

La compañia mas cara es porsche

3. Imprimir todos los detalles de Toyota Cars

In [18]:
df_toyota = df_2.loc[lambda x: x['company'] == 'toyota']
print(df_toyota.describe(include = 'all'))

       company body-style  wheel-base      length engine-type  \
count        7          7    7.000000    7.000000           7
unique       1          2         NaN         NaN           2
top     toyota      wagon         NaN         NaN         ohc
freq         7          4         NaN         NaN           6
mean       NaN        NaN   96.957143  167.571429         NaN
std        NaN        NaN    3.326087   10.479299         NaN
min        NaN        NaN   95.700000  158.700000         NaN
25%        NaN        NaN   95.700000  158.700000         NaN
50%        NaN        NaN   95.700000  169.700000         NaN
75%        NaN        NaN   95.700000  169.700000         NaN
max        NaN        NaN  104.500000  187.800000         NaN

       num-of-cylinders  horsepower  average-mileage         price
count                 7    7.000000         7.000000      7.000000
unique                2         NaN              NaN           NaN
top                four         NaN              NaN           NaN
freq                  6         NaN              NaN           NaN
mean                NaN   75.428571        28.714286   8216.857143
std                 NaN   35.528660         5.089672   3502.409048
min                 NaN   62.000000        19.000000   5348.000000
25%                 NaN   62.000000        27.000000   6413.000000
50%                 NaN   62.000000        31.000000   6918.000000
75%                 NaN   62.000000        31.000000   8338.000000
max                 NaN  156.000000        35.000000  15750.000000

4. Cuente el total de automóviles por compañía

In [19]:
car_p_comp = dict()
for comp in comps:
    df_aux = df_2.loc[lambda x: x['company'] == comp]
    row, col = df_aux.shape
    car_p_comp[comp] = row
print(car_p_comp)

{'alfa-romero': 3, 'audi': 4, 'bmw': 6, 'chevrolet': 3, 'dodge': 2, 'honda': 3, 'isuzu': 1, 'jaguar': 3, 'mazda': 5, 'mercedes-benz': 4, 'mitsubishi': 4, 'nissan': 5, 'porsche': 2, 'toyota': 7, 'volkswagen': 4, 'volvo': 2}

5. Encuentra el coche con el precio más alto por compañía

In [20]:
max_p_comp = dict()
for comp in comps:
    df_aux = df_2.loc[lambda x: x['company'] == comp]
    max_price = df_aux['price'].max()
    max_p_comp[comp] = max_price
print(max_p_comp)

{'alfa-romero': 16500.0, 'audi': 18920.0, 'bmw': 41315.0, 'chevrolet': 6575.0, 'dodge': 6377.0, 'honda': 12945.0, 'isuzu': 6785.0, 'jaguar': 36000.0, 'mazda': 18344.0, 'mercedes-benz': 45400.0, 'mitsubishi': 8189.0, 'nissan': 13499.0, 'porsche': 37028.0, 'toyota': 15750.0, 'volkswagen': 9995.0, 'volvo': 13415.0}

6. Encuentre el kilometraje promedio (**average-mileage**) de cada compañía automotriz

In [21]:
avgm_comp = dict()
for comp in comps:
    df_aux = df_2.loc[lambda x: x['company'] == comp]
    avgm = df_aux['average-mileage'].mean()
    avgm_comp[comp] = avgm
print(avgm_comp)

{'alfa-romero': 20.333333333333332, 'audi': 20.0, 'bmw': 19.0, 'chevrolet': 41.0, 'dodge': 31.0, 'honda': 26.333333333333332, 'isuzu': 24.0, 'jaguar': 14.333333333333334, 'mazda': 28.0, 'mercedes-benz': 18.0, 'mitsubishi': 29.5, 'nissan': 31.4, 'porsche': 17.0, 'toyota': 28.714285714285715, 'volkswagen': 31.75, 'volvo': 23.0}

7. Ordenar todos los autos por columna de precio (**price**)

In [22]:
df_2 = df_2.sort_values('price',ascending = True)
print(df_2.head())

          company body-style  wheel-base  length engine-type num-of-cylinders  \
index
16      chevrolet  hatchback        88.4   141.1           l            three
36          mazda  hatchback        93.1   159.1         ohc             four
66         toyota  hatchback        95.7   158.7         ohc             four
49     mitsubishi  hatchback        93.7   157.3         ohc             four
37          mazda  hatchback        93.1   159.1         ohc             four

       horsepower  average-mileage   price
index
16             48               47  5151.0
36             68               30  5195.0
66             62               35  5348.0
49             68               37  5389.0
37             68               31  6095.0

## Problema 03


Siguiendo la temática de los automóviles, resuelva los siguientes problemas:

### a) Subproblema 01
A partir de los siguientes diccionarios:

In [23]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'],
              'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 
                'Price': [29995, 23600, 61500 , 58900]}

* Cree dos dataframes (**carsDf1** y **carsDf2**) según corresponda.
* Concatene ambos dataframes (**carsDf**) y añada una llave ["Germany", "Japan"], según corresponda.

In [24]:
Ger_data = list()
for i in range(len(GermanCars['Company'])):
    Ger_data.append([GermanCars['Company'][i],GermanCars['Price'][i]])
carsDf1 = pd.DataFrame(
    Ger_data,
    columns = ["comp","price"]
    
)
print (carsDf1)

Jap_data = list()
for i in range(len(japaneseCars['Company'])):
    Jap_data.append([japaneseCars['Company'][i],japaneseCars['Price'][i]])
carsDf2 = pd.DataFrame(
    Jap_data,
    columns = ["comp","price"]
    
)
print (carsDf2)
carsDf = pd.DataFrame()
frames = [carsDf1,carsDf2]
carsDf = pd.concat(frames, keys=["Germany", "Japan"])
print(carsDf)

       comp   price
0      Ford   23845
1  Mercedes  171995
2       BMV  135925
3      Audi   71400
          comp  price
0       Toyota  29995
1        Honda  23600
2       Nissan  61500
3  Mitsubishi   58900
                  comp   price
Germany 0         Ford   23845
        1     Mercedes  171995
        2          BMV  135925
        3         Audi   71400
Japan   0       Toyota   29995
        1        Honda   23600
        2       Nissan   61500
        3  Mitsubishi    58900

### b) Subproblema 02

A partir de los siguientes diccionarios:

In [25]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

* Cree dos dataframes (**carsDf1** y **carsDf2**) según corresponda.
*  Junte ambos dataframes (**carsDf**) por la llave **Company**.

In [26]:
price_data=list()
for i in range(len(Car_Price['Company'])):
    price_data.append([Car_Price['Company'][i],Car_Price['Price'][i]])
    
carsDf1 = pd.DataFrame(
    price_data,
    columns = ['comp','price']
)
print(carsDf1)

hp_data=list()
for i in range(len(car_Horsepower['Company'])):
    hp_data.append([car_Horsepower['Company'][i],car_Horsepower['horsepower'][i]])
    
carsDf2 = pd.DataFrame(
    hp_data,
    columns = ['comp','hp']
)
print(carsDf2)
carsDf = pd.merge(carsDf1, carsDf2, on='comp', how='outer')

print(carsDf)

     comp   price
0  Toyota   23845
1   Honda   17995
2     BMV  135925
3    Audi   71400
     comp   hp
0  Toyota  141
1   Honda   80
2     BMV  182
3    Audi  160
     comp   price   hp
0  Toyota   23845  141
1   Honda   17995   80
2     BMV  135925  182
3    Audi   71400  160